[
    { "query": "Give me a thriller from the 1990s, directed by Quentin Tarantino, starring Brad Pitt, with a runtime over 2 hours." },
    { "query": "Can you suggest a romantic drama from the 1980s, directed by Steven Spielberg, starring Meryl Streep, and under 100 minutes?" },
    { "query": "Show me a sci-fi movie directed by Ridley Scott, from the 2000s, that’s about 120 minutes long." },
    { "query": "Give me a comedy from the 1990s with a happy ending, starring Tom Hanks, and directed by Nora Ephron." },
    { "query": "I want a movie with a strong female lead, directed by Greta Gerwig, from the 2010s, that’s about 100 minutes long." },
    { "query": "Show me a war movie from the 1960s, directed by Stanley Kubrick, starring Matthew McConaughey, with a runtime of 150 minutes." },
    { "query": "Can you recommend a movie from the 2000s, directed by Christopher Nolan, with a runtime of 120 minutes and a psychological thriller theme?" },
    { "query": "Give me a crime drama from the 1980s, starring Robert Downey Jr., directed by Martin Scorsese, with a runtime of 90 minutes." },
    { "query": "I want to watch a family-friendly movie from the 1990s, directed by John Hughes, with a runtime under 100 minutes." },
    { "query": "Can you recommend a dystopian sci-fi movie, directed by Bong Joon-ho, from the 2010s, starring Scarlett Johansson, and lasting about 2 hours?" },
    { "query": "Give me a romantic comedy from the 2000s, starring Leonardo DiCaprio, directed by Paul Thomas Anderson, with a runtime of 90 minutes." },
    { "query": "Show me a fantasy film from the 1970s, directed by George Lucas, with a runtime of 120 minutes." },
    { "query": "Can you suggest a historical drama from the 1960s, starring Audrey Hepburn, and directed by Alfred Hitchcock, that’s under 90 minutes?" },
    { "query": "Give me an action film from the 2010s, starring The Rock, directed by Michael Bay, with a runtime of 130 minutes." },
    { "query": "I want to watch a film directed by Wes Anderson, from the 2000s, that’s a quirky comedy with a runtime under 100 minutes." },
    { "query": "Show me a mystery movie from the 1990s, directed by David Fincher, with a runtime of 100 minutes and starring Brad Pitt." },
    { "query": "Give me a movie from the 1980s, directed by Ridley Scott, that’s about 2 hours long and has a thriller genre." },
    { "query": "Can you suggest a romantic movie directed by Sofia Coppola, starring Keanu Reeves, from the 1990s, with a runtime of 120 minutes?" },
    { "query": "I want a film from the 2010s, directed by Bong Joon-ho, starring Jake Gyllenhaal, with a runtime under 90 minutes and a tragic ending." },
    { "query": "Give me an adventure film from the 2000s, directed by Peter Jackson, starring Cate Blanchett, and about 2 hours long." },
    { "query": "Show me a film from the 1970s, directed by Francis Ford Coppola, with a runtime of 150 minutes, and a deep emotional storyline." },
    { "query": "Can you recommend a film directed by Tim Burton, starring Johnny Depp, from the 1990s, with a runtime of 90 minutes?" },
    { "query": "Give me a movie from the 2000s, starring Natalie Portman, directed by Darren Aronofsky, with a runtime of 100 minutes and an emotional tone." },
    { "query": "Show me a thriller directed by Ridley Scott, from the 1990s, starring Leonardo DiCaprio, that’s over 2 hours long." },
    { "query": "Give me a sci-fi film from the 1980s, directed by James Cameron, with a runtime of 120 minutes and a happy ending." },
    { "query": "I want a romantic film directed by Richard Linklater, starring Ethan Hawke, from the 2010s, with a runtime of 90 minutes." },
    { "query": "Show me a fantasy movie from the 1960s, directed by Stanley Kubrick, with a runtime over 2 hours." },
    { "query": "Give me a mystery movie from the 2000s, starring Ben Affleck, directed by Ridley Scott, that’s 120 minutes long." },
    { "query": "Can you recommend a movie from the 1980s, starring Denzel Washington, directed by Spike Lee, with a runtime under 90 minutes?" },
    { "query": "I want a drama from the 1990s, directed by Ang Lee, starring Julia Roberts, with a runtime of 150 minutes." }
]